rpi5-32/20240731-0853-glibc-default/logs/pgbench-no-0-32768-10/pgbench.log
pgbench (18devel)
transaction type: <builtin: select only>
scaling factor: 1
partition method: range
partitions: 10
query mode: prepared
number of clients: 8
number of threads: 8
maximum number of tries: 1
duration: 10 s
number of transactions actually processed: 407423
number of failed transactions: 0 (0.000%)
latency average = 0.196 ms
initial connection time = 8.368 ms
tps = 40766.441887 (without initial connection time)